'''
Created on 2023. 7. 19.

@author: Comi
'''

import pandas as pd
import numpy as np

mycolumn = ['집계일자', '집계시', '영업소코드', '입출구구분코드', \
            'TCS하이패스구분코드', '1종교통량', '2종교통량', \
            '3종교통량', '4종교통량', '5종교통량', '6종교통량', '총교통량', 'Noname']

filename = 'capital_area.csv'

#파일 출력
df = pd.read_table(filename,sep="|",names=mycolumn)
print(df)

print('-------------------------')

print(df['영업소코드'])  #Series
'''
0        101
1        101
        ... 
15934    254
15935    254
'''

print('-------------------------')

print(df[['영업소코드']])  #DataFrame
'''
       영업소코드
0        101
1        101
...      ...
15934    254
15935    254
'''

print('-------------------------')

#방법1
print(df[['영업소코드','총교통량','1종교통량']])

#방법2
print(df.reindex(columns=['영업소코드','총교통량','1종교통량']))

'''
       영업소코드  총교통량  1종교통량
0        101   441    379
1        101  1370   1000
...      ...   ...    ...
15934    254   323    264
15935    254   993    864
'''

print('-------------------------')

#df.groupby(칼럼명)

'''
영업소코드별 총교통량 합계 구하기

          총교통량
영업소코드         
101    5817454
190    3701132
253    5235574
254    2675218
651    1715680
685    1580989
'''
mygroup = df.groupby('영업소코드')
print(len(mygroup))

#방법1
print(mygroup['총교통량'].sum())    #Series
print()

#방법2
print(mygroup['총교통량'].apply(np.sum))    #Series
print()

#방법3
print(mygroup[['총교통량']].apply(np.sum))    #DataFrame
print()

#방법4
print(mygroup.sum().reindex(columns=['총교통량']))  #DataFrame
print()

print('-------------------------')

'''
영업소코드별 총교통량, 2종교통량 합계 구하기

          총교통량   2종교통량
영업소코드                 
101    5817454  161326
190    3701132  150361
253    5235574  163125
254    2675218   87445
651    1715680   33402
685    1580989   67311
'''

print(mygroup[['총교통량','2종교통량']].sum())

print('-------------------------')

'''
영엽소코드가 190인 데이터만 가져오기

        집계일자  집계시  영업소코드  입출구구분코드  ...  5종교통량  6종교통량  총교통량  Noname
4      20170201    0    190        0  ...      4      2   149     NaN
5      20170201    0    190        0  ...     26     22   463     NaN
...         ...  ...    ...      ...  ...    ...    ...   ...     ...
15926  20170228   23    190        1  ...      5     30   362     NaN
15927  20170228   23    190        1  ...     21     39  1224     NaN
'''
print(df[df['영업소코드'] == 190])

print('-------------------------')

'''
1종교통량 중 최대값과 최소값 가져오기

1종교통량    6104
1종교통량    6
'''
#방법1
print(df[['1종교통량']].apply(np.max))
print()
print(df[['1종교통량']].apply(np.min))
print()

#방법2
print(df['1종교통량'].max())
print()
print(df['1종교통량'].min())

print('-------------------------')

'''
영업소코드별 1종교통량 최대값 구하기

       1종교통량
영업소코드       
101     5403
190     4349
253     6104
254     2522
651     2667
685     2160
'''
print(df.groupby('영업소코드')[['1종교통량']].max())





